In [5]:
import pandas as pd
import numpy as np
from numpy import nan as NA
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
pd.__version__

'1.4.3'

In [20]:
tr_data = pd.read_csv('../datasets/titanic/train.csv')
tr_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
tr_data.shape

(418, 11)

In [25]:
(tr_data
[tr_data['Age'] < 16 ]
.describe()
)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,83.000000,83.000000,83.000000,83.000000,83.000000,83.000000,83.000000
mean,431.602410,0.590361,2.626506,6.369518,1.734940,1.265060,32.785795
std,287.079319,0.494757,0.619024,4.729063,1.638592,0.682255,33.466438
min,8.000000,0.000000,1.000000,0.420000,0.000000,0.000000,7.225000
25%,172.500000,0.000000,2.000000,2.000000,0.000000,1.000000,15.900000
50%,436.000000,1.000000,3.000000,5.000000,1.000000,1.000000,26.250000
75%,706.500000,1.000000,3.000000,9.500000,3.000000,2.000000,32.193750
max,876.000000,1.000000,3.000000,15.000000,5.000000,2.000000,211.337500